chcp 65001

@echo off
echo Початок виконання сценарію
ping 127.0.0.1 -n 2 > nul

echo Створення прихованої папки
ping 127.0.0.1 -n 2 > nul
mkdir "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Прихована папка"
attrib +h "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Прихована папка"

echo Створення не прихованої папки
ping 127.0.0.1 -n 2 > nul
mkdir "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Не прихована папка"

echo Виведення допомоги з використання xcopy
ping 127.0.0.1 -n 2 > nul
xcopy /?
ping 127.0.0.1 -n 2 > nul

echo Запис xcopy до файлу
ping 127.0.0.1 -n 2 > nul
xcopy /? > "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Не прихована папка\copyhelp.txt"

echo Копіювання файлу "copyhelp.txt" до каталогу "Прихована папка"
ping 127.0.0.1 -n 2 > nul
xcopy "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Не прихована папка\copyhelp.txt" "Лабараторні\ПЗ-22у-1\Корчев Євгеній Андрійович\batch\Прихована папка\copied_copyhelp.txt*"

pause